<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Slack.</string>
	<key>Identifier</key>
	<string>com.github.civisanalytics.download.slack</string>
	<key>Input</key>
	<dict>
  	<key>NAME</key>
  	<string>Slack</string>
  	<key>DOWNLOAD_URL</key>
  	<string>https://slack.com/ssb/download-osx</string>
  	<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
  	<false/>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>/Users/Shared/%NAME%.dmg/Slack.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
