
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads latest Fire Fox disk image.</string>
  <key>Identifier</key>
  <string>com.github.jusblan331.download.firefox</string>
  <key>Input</key>
  <dict>
      <key>NAME</key>
      <string>FireFox</string>
      <key>DOWNLOAD_URL</key>
      <string>https://download.mozilla.org/?product=firefox-latest&os=osx&lang=en-US</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>Process</key>
  <array>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
              <key>url</key>
              <string>%DOWNLOAD_URL%</string>
              <key>filename</key>
              <string>%NAME%.dmg</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
      <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
              <key>input_path</key>
              <string>%pathname%/Fire Fox.app</string>
              <key>strict_verification</key>
              <false/>
              <key>requirement</key>
              <string>(identifier "org.mozilla.firefox" or identifier "org.mozilla.firefoxdeveloperedition")</string>
          </dict>
      </dict>
  </array>
</dict>
</plist>
