
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads latest Atom disk image.</string>
  <key>Identifier</key>
  <string>com.github.jusblan331.download.atom</string>
  <key>Input</key>
  <dict>
      <key>NAME</key>
      <string>Atom</string>
      <key>DOWNLOAD_URL</key>
      <string>https://atom.io/download/mac</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>Process</key>
  <array>
      <dict>
          <key>Processor</key>
          <string>CURLDownloader</string>
          <key>Arguments</key>
          <dict>
              <key>url</key>
              <string>%DOWNLOAD_URL%</string>
              <key>filename</key>
              <string>%NAME%.zip</string>
          </dict>
      </dict>
      <dict>
  			<key>Processor</key>
  			<string>Unarchiver</string>
  			<key>Arguments</key>
  			<dict>
  				<key>archive_path</key>
  				<string>%pathname%</string>
  				<key>destination_path</key>
  				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
  				<key>purge_destination</key>
  				<true/>
  			</dict>
  		</dict>
      <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
      <dict>
          <key>Processor</key>
          <string>AppPkgCreator</string>
          <key>Arguments</key>
          <dict>
              <key>app_path</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
              <key>pkg_path</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>FileMover</string>
          <key>Arguments</key>
          <dict>
              <key>source</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
              <key>target</key>
              <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
          </dict>
      </dict>
  </array>
</dict>
</plist>
